sym_v0/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;
sourceCase "."; //"$FOAM_CASE";
sourcePatches (front);
exposedPatchName back; //

flipNormals false;

extrudeModel        linearDirection;

nLayers             1;
//expansionRatio      1.0;

linearDirectionCoeffs
{
    //axisPt          (0 0 0);
    direction       (0 1 0);
    thickness       0.01;
}

mergeFaces false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
