sym_v0/0/AoW5
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "2000";
    object      AoW5;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 5 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    "(outlet1|outlet2)"
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    "(walls|upWalls|downWalls|bottom|placaScale_v4)"
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    half
    {
        type            symmetry;
    }
      
}


// ************************************************************************* //
