sym_v0/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.4e-08;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 3.4e-08;
    }
    "(outlet1|outlet2)"
    {
        type            zeroGradient;
    }
    "(walls|upWalls|downWalls|bottom|placaScale_v4)"
    {
        type            epsilonWallFunction;
	lowRecorrection	true;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    half
    {
        type            symmetry;
    }
}


// ************************************************************************* //
