sym_v0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5e-06;

boundaryField
{


    inlet
    {
        type            fixedValue;
        value           uniform 1.5e-04;
    }
    "(outlet1|outlet2)"
    {
        type            zeroGradient;
    }
    "(walls|upWalls|downWalls|bottom|placaScale_v4)"
    {   
	type            fixedValue;
        value           uniform 1e-10;
    }

    top
    {
        type            zeroGradient;
    }

    half
    {
        type            symmetry;
    }
}


// ************************************************************************* //
