sym_v0/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 1e-06;
    }
    "(outlet1|outlet2)"
    {
        type            calculated;
        value           uniform 0;
    }
    "(walls|upWalls|downWalls|bottom|placaScale_v4)"
    {
        type            fixedValue; //nutUSpaldingWallFunction;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    half
    {
        type            symmetry;
    }
}


// ************************************************************************* //
