sym_v0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0;  
        smoother        DIC; 
        nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   2;
        cacheAgglomeration false;
        nCellsInCoarsestLevel 1000;//10000;
        agglomerator    faceAreaPair;
        mergeLevels     1;

    /*    solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
	maxIter		4000;*/
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

    Phi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
	maxIter		2000;
    }

    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

    epsilon
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

    "(AoW|AoW2|AoW3|AoW4|AoW5)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent      yes;
    //pRefCell        0;
    //pRefValue       0;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
	epsilon		1e-5;
	k		1e-5;
    }
}

relaxationFactors
{
    p               0.2 ;//0.3;
    U               0.7; //0.9;
    k               0.9;
    epsilon         0.9;
    nut             0.9;
    "(AoW|AoW2)"             0.9;
}

// Para icoFoam

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

    potentialFlow
    {
        nNonOrthogonalCorrectors  10;
    }




// ************************************************************************* //
