sym_v0/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dictionaryReplacement
//{
    boundary
    {
        upWalls
        {
            type            wall;
        }
        downWalls
        {
            type            wall;
        }
        walls
        {
            type            wall;
        }
        bottom
        {
            type            wall;
        }

        half
        {
            type            symmetry;
        }
    }

//}

// ************************************************************************* //
