sym_v0/system/refineDict_N1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             N1;

coordinateSystem global;

globalCoeffs
{
    tan1            ( 1 0 0 );
    tan2            ( 0 1 0 );
    tan3            ( 0 0 1 );
}

patchLocalCoeffstutorial
{/*tutorialtutorial
    patch           cilindro;
    tan3            ( 0 0 1 );
    //tan2            ( 0 1 0 );

    patch           internas;
    tan3            ( 0 0 1 );
*/}

directions
(
	tan1
	tan2
	normal
 );

useHexTopology  true;

geometricCut    false;

writeMesh       false;


// ************************************************************************* //
