sym_v0/system/topoSetDict_N3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//example: https://openfoamwiki.net/index.php/TopoSet

xOrigen 0.146;
yOrigen 0.165;
zOrigen 0.525;

deltaX  0.02;
deltaY  0.01;
deltaZ  0.016;

actions
(
  {
    name    N3;
    type    cellSet;
    action  new;
    source surfaceToCell;
    sourceInfo
    {
        file            "constant/triSurface/placaScale_v4.stl"; //"www.avl.com-geometry.stl";
        useSurfaceOrientation false;  // use closed surface inside/outside
                                      // test (ignores includeCut,
                                      // outsidePoints)
        outsidePoints   ((0.166 0.150 0.20));    // definition of outside
        includeCut      false;              // cells cut by surface
        includeInside   false;              // cells not on outside of surf
        includeOutside  false;              // cells on outside of surf
        nearDistance    0.004;              // cells with centre near surf
                                            // (set to -1 if not used)
        curvature       -100;               // cells within nearDistance
                                            // and near surf curvature
                                            // (set to -100 if not used)
    }
  }

  {
    name    inletN3;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
            box
                ( #eval{ $xOrigen } #eval{ $yOrigen - $:deltaY } #eval{ $zOrigen - $:deltaZ } )
                ( #eval{ $xOrigen + $:deltaX } #eval{ $yOrigen + $:deltaY } #eval{ $zOrigen } );
//      box (0.146 148 0.516) (0.1646 0.166 0.526);
    }
  }

);




